results/run-100vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.1s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.1s), 100/100 VUs, 51 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.1s), 100/100 VUs, 116 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.1s), 100/100 VUs, 161 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.1s), 100/100 VUs, 229 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.1s), 100/100 VUs, 318 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.1s), 100/100 VUs, 394 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.1s), 100/100 VUs, 456 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.1s), 100/100 VUs, 529 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.1s), 100/100 VUs, 615 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.1s), 100/100 VUs, 706 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.1s), 100/100 VUs, 785 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.1s), 100/100 VUs, 829 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.1s), 100/100 VUs, 915 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.1s), 100/100 VUs, 1006 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.1s), 100/100 VUs, 1085 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.1s), 100/100 VUs, 1154 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.1s), 100/100 VUs, 1217 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.1s), 100/100 VUs, 1306 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.1s), 100/100 VUs, 1379 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.1s), 100/100 VUs, 1448 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.1s), 100/100 VUs, 1519 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.1s), 100/100 VUs, 1601 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.1s), 100/100 VUs, 1667 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.1s), 100/100 VUs, 1738 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.1s), 100/100 VUs, 1818 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.1s), 100/100 VUs, 1899 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.1s), 100/100 VUs, 1983 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.1s), 100/100 VUs, 2038 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.1s), 100/100 VUs, 2118 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.1s), 100/100 VUs, 2199 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.1s), 100/100 VUs, 2280 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.1s), 100/100 VUs, 2362 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.1s), 100/100 VUs, 2431 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.1s), 100/100 VUs, 2496 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.1s), 100/100 VUs, 2581 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.1s), 100/100 VUs, 2662 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.1s), 100/100 VUs, 2732 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.1s), 100/100 VUs, 2812 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.1s), 100/100 VUs, 2881 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.1s), 100/100 VUs, 2962 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.1s), 100/100 VUs, 3032 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.1s), 100/100 VUs, 3112 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.1s), 100/100 VUs, 3196 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.1s), 100/100 VUs, 3280 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.1s), 100/100 VUs, 3332 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.1s), 100/100 VUs, 3412 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.1s), 100/100 VUs, 3496 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.1s), 100/100 VUs, 3581 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.1s), 100/100 VUs, 3662 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.1s), 100/100 VUs, 3712 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.1s), 100/100 VUs, 3796 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.1s), 100/100 VUs, 3881 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.1s), 100/100 VUs, 3961 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.1s), 100/100 VUs, 4031 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.1s), 100/100 VUs, 4109 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.1s), 100/100 VUs, 4180 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.1s), 100/100 VUs, 4252 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.1s), 100/100 VUs, 4314 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s

running (1m01.1s), 023/100 VUs, 4391 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 4414    72.020576/s
    checks_succeeded...: 100.00% 4414 out of 4414
    checks_failed......: 0.00%   0 out of 4414

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=167.54ms min=55.47ms med=222.25ms max=3.95s p(90)=233.24ms p(95)=235.37ms
      { expected_response:true }...: avg=167.54ms min=55.47ms med=222.25ms max=3.95s p(90)=233.24ms p(95)=235.37ms
    http_req_failed................: 0.00%  0 out of 8828
    http_reqs......................: 8828   144.041152/s

    EXECUTION
    iteration_duration.............: avg=1.37s    min=1.28s   med=1.32s    max=7.17s p(90)=1.33s    p(95)=1.34s   
    iterations.....................: 4414   72.020576/s
    vus............................: 23     min=23        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 17 MB  276 kB/s
    data_sent......................: 747 kB 12 kB/s



running (1m01.3s), 000/100 VUs, 4414 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s